Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ParameterString Property
 The profile item parameter string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ParameterString { get; }
Public ReadOnly Property ParameterString As String
	Get
Property Value
Type: String
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace